IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection
Reinforced cross-section
This sample shows how to create reinforced cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
//...
openModel.AddObject(mat);
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
//...
openModel.AddObject(matR);
//Cross-section without the bars
//One component square 0.8x0.8m
IdeaRS.OpenModel.CrossSection.CrossSectionComponent css = new IdeaRS.OpenModel.CrossSection.CrossSectionComponent();
css.Name = "CSS1";
//Component of cross-section
CssComponent comp = new CssComponent();
comp.Material = new ReferenceElement(mat);
comp.Phase = 0;
//Geometry of component 0.8x0.8
Region2D region = new Region2D();
PolyLine2D outline = new PolyLine2D();
outline.StartPoint = new Point2D();
outline.StartPoint.X = -0.04;
outline.StartPoint.Y = -0.04;
LineSegment2D seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.04;
seg.EndPoint.Y = -0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.04;
seg.EndPoint.Y = 0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.04;
seg.EndPoint.Y = 0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.04;
seg.EndPoint.Y = -0.04;
outline.Segments.Add(seg);
region.Outline = outline;
//Optional - setting openning in this component 0,2x0,2
PolyLine2D openning = new PolyLine2D();
openning.StartPoint = new Point2D();
openning.StartPoint.X = -0.01;
openning.StartPoint.Y = -0.01;
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.01;
seg.EndPoint.Y = 0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.01;
seg.EndPoint.Y = 0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.01;
seg.EndPoint.Y = -0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.01;
seg.EndPoint.Y = -0.01;
openning.Segments.Add(seg);
region.Openings.Add(openning);
comp.Geometry = region;
css.Components.Add(comp);
openModel.AddObject(css);
//Reinforced cross-section (references cross-section and adds the bars)
//bar 8mm in each corner
ReinforcedCrossSection rcs = new ReinforcedCrossSection();
rcs.Name = "RCSS1";
rcs.CrossSection = new ReferenceElement(css);
//One bar in the corner
ReinforcedBar bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = -0.025;
bar.Point.Y = -0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = 0.025;
bar.Point.Y = -0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = 0.025;
bar.Point.Y = 0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = -0.025;
bar.Point.Y = 0.025;
rcs.Bars.Add(bar);
openModel.AddObject(rcs);

IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection.#ctor
Constructor

IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection.Name
Name of cross-section

IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection.CrossSection
Cross-section

IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection.Bars
Reinforced bars

IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection.Stirrups
Stirrups